 m2engineeringsoftware/talend/pivot/trunk/src/main/resources/com.sodifrance.stage.esb.talend.cfg

payload.cd=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_cd.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getAllCD/></soapenv:Body></soapenv:Envelope>
payload.book=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_book.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getAllBook/></soapenv:Body></soapenv:Envelope>
query.book=xquery:com/sodifrance/stage/esb/talend/query-book.xq
query.cd=xquery:com/sodifrance/stage/esb/talend/query-cd.xq
query.merge=xquery:com/sodifrance/stage/esb/talend/merge.xq
namespace.cd=http://referential_cd.sodifrance.com/
namespace.book=http://referential_book.sodifrance.com/
http.address.cd=http://localhost:8080/referential-cd/services/1.0.0/CDWSImplPort/
http.address.book=http://localhost:8080/referential-book/services/1.0.0/BookWSImplPort/