 m2engineeringsoftware/talend/router/branch/routerWithOperationGetArticleConditional/src/main/resources/com.sodifrance.stage.esb.talend.cfg

payload.cd=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_cd.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getAllCD/></soapenv:Body></soapenv:Envelope>
payload.book=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_book.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getAllBook/></soapenv:Body></soapenv:Envelope>
payload.all=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://talend.esb.stage.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getAllArticle/></soapenv:Body></soapenv:Envelope>
payload.idBegin=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://talend.esb.stage.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getArticleConditional><wantedkind>all</wantedkind><id>
payload.idEnd=</id></ref:getArticleConditional></soapenv:Body></soapenv:Envelope>
payload.idCDBegin=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_cd.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getCD><arg0>
payload.idCDEnd=</arg0></ref:getCD></soapenv:Body></soapenv:Envelope>
payload.idBookBegin=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ref="http://referential_book.sodifrance.com/"><soapenv:Header/><soapenv:Body><ref:getBook><arg0>
payload.idBookEnd=</arg0></ref:getBook></soapenv:Body></soapenv:Envelope>
query.book=xquery:com/sodifrance/stage/esb/talend/query-book.xq
query.cd=xquery:com/sodifrance/stage/esb/talend/query-cd.xq
query.merge=xquery:com/sodifrance/stage/esb/talend/merge.xq
query.conditional.book=xquery:com/sodifrance/stage/esb/talend/query-unic-book.xq
query.conditional.cd=xquery:com/sodifrance/stage/esb/talend/query-unic-cd.xq
query.conditional.merge=xquery:com/sodifrance/stage/esb/talend/query-unic-merge.xq
query.conditional-response=xquery:com/sodifrance/stage/esb/talend/query-to-conditional-response.xq
namespace.cd=http://referential_cd.sodifrance.com/
namespace.book=http://referential_book.sodifrance.com/
namespace.all=http://talend.esb.stage.sodifrance.com/
http.address.all=http://localhost:8085/articleService/
http.address.cd=http://localhost:8080/referential-cd/services/1.0.0/CDWSImplPort/
http.address.book=http://localhost:8080/referential-book/services/1.0.0/BookWSImplPort/